import pandas as pd

data = {
    'Студент': ['Петр', 'Инга', 'Василий', 'Егор', 'Ренат', 'Арина', 'Елена', 'Лев', 'Ксения', 'Юлия'],
    'Русский язык':[4,5,3,4,5,3,5,5,4,4],
    'Литература': [3,5,3,4,5,4,4,3,3,5],
    'Математика': [4,3,5,5,5,5,3,4,5,4],
    'Химия': [5,4,4,4,5,3,5,4,4,4],
    'История': [5,4,5,5,5,3,5,4,4,5]
}
df = pd.DataFrame(data)
print(df.head(10))
print('-'*80 + '\nСредняя оценка по предмету:')
print(f'Русский язык - {df['Русский язык'].mean()}')
print(f'Литература - {df['Литература'].mean()}')
print(f'Математика - {df['Математика'].mean()}')
print(f'Химия - {df['Химия'].mean()}')
print(f'История - {df['История'].mean()}')

print('-'*80 + '\nМедианная оценка по предмету:')
print(f'Русский язык - {df['Русский язык'].median()}')
print(f'Литература - {df['Литература'].median()}')
print(f'Математика - {df['Математика'].median()}')
print(f'Химия - {df['Химия'].median()}')
print(f'История - {df['История'].median()}')

print('-'*80 + '\nКвартили оценок по математике:')
q1 = df['Математика'].quantile(0.25)
print(f'Первый квартиль - {q1}')
q3 = df['Математика'].quantile(0.75)
print(f'Третий квартиль - {q3}')
iqr = q3 - q1
print(f'Межквартальный размах - {iqr}')

print('-'*80 + '\nСтандартное отклонение по предмету:')
print(f'Русский язык - {df['Русский язык'].std()}')
print(f'Литература - {df['Литература'].std()}')
print(f'Математика - {df['Математика'].std()}')
print(f'Химия - {df['Химия'].std()}')
print(f'История - {df['История'].std()}')